# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import pandas as pd
l= pd.Series([2, 4, 6, 8, 10])
m= pd.Series([1, 3, 5, 7, 9])
print('series multiplication is \n', l*m)
print('series addition is \n', l-m)
print('series division is \n', l/m)

series multiplication is
 0     2
1    12
2    30
3    56
4    90
dtype: int64
series addition is
 0    1
1    1
2    1
3    1
4    1
dtype: int64
series division is
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [21]:
dctnary = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
convser = pd.Series(dctnary)
convser

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [30]:
p = {0:100, 1:200, 2:'python', 3:300.12, 4:400}
dic_p = pd.Series(p)
print(dic_p)
num_p = pd.to_numeric(dic_p, errors = 'coerce')
print(num_p)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [43]:
Data = [[1,4,7],[2,5,5], [3,6,8], [4,9,12], [7,5,1], [11,0,11]]
dataframe = pd.DataFrame(Data, columns = ['col1','col2','col3'])
col1_ser = pd.Series(dataframe['col1'])
print('First column as a series\n',col1_ser)
type(col1_ser)

First column as a series
 0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

pandas.core.series.Series

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [58]:
ss = pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print('Mean of the said Data Series is ', ss.mean())
print('Standard deviation of the said Data Series is ', ss.std())

Mean of the said Data Series is  4.818181818181818
Standard deviation of the said Data Series is  2.522624895547565

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [71]:
import numpy as np
calc = {'X':[1,2,3,4,5],' Y ':[0,1,2,3,4], 'Z':np.power(ser1,ser2)}
out = pd.DataFrame(calc)
print(out)

   X   Y     Z
0  1    0    1
1  2    1    2
2  3    2    9
3  4    3   64
4  5    4  625

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [91]:
labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
lab_data = pd.DataFrame(labelsexam_data, index = labels)

print('The first 3 rows of the data frame is \n',lab_data.iloc[0:3])

The first 3 rows of the data frame is
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [102]:
#Derieving from the previous question we have the lab_data as 
print('The given Dataframe is \n',lab_data)
print('\n\nThe desired output is \n', lab_data.iloc[[1,3,5,6],[0,1]])

The given Dataframe is
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2     no
f    Michael   20.0         3    yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes


The desired output is
       name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [105]:
#Derieving from the previous question we have the lab_data as 
print('OutputMean score for each different student in data frame: \n', lab_data['score'].mean())

OutputMean score for each different student in data frame:
 13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [114]:
sam = {'col1':[1,2,3], 'col2':[4,5,6], 'col3':[7,8,9]}
sam_df =  pd.DataFrame(sam)
print(sam_df)
out_df = sam_df.rename(columns = {'col1': 'Column1', 'col2':'Column2', 'col3': 'Column3'})
print('\n New dataframe post renaming the columns \n\n',out_df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

 New dataframe post renaming the columns

    Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [126]:
p = {'city': ['California', 'Georgia', 'Los Angeles'], 'Number of people':[4,2,4]}
p_data = pd.DataFrame(p)
print(p_data)
p_data['Number of people'].sum()

#Dataset missing

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

10

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [136]:
pp = {'col1':[1,4,3,4,5],'col2':[4,5,6,7,8],'col3':[7,8,9,0,1]}
pp_dataframe = pd.DataFrame(pp)
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 100)
print(pp_dataframe)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [161]:
date = pd.DataFrame(['3/11/2000', '3/12/2000', '3/13/2000'])
pd.to_datetime(date[0])

0   2000-03-11
1   2000-03-12
2   2000-03-13
Name: 0, dtype: datetime64[ns]


Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [171]:
dt1 = pd.DataFrame()
print(dt1)

d2 = ['col1','col2',0,0,0,1,1,1,2,2,2]
dt2=pd.DataFrame(d2)

dt_appended = dt1.append(dt2)
print(dt_appended)

Empty DataFrame
Columns: []
Index: []
       0
0   col1
1   col2
2      0
3      0
4      0
5      1
6      1
7      1
8      2
9      2
10     2

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [177]:
pp = {'col1':[1,2,3,4,7],'col2':[4,5,6,9,5],'col3':[7,8,12,1,11]}
pp_data = pd.DataFrame(pp)
print('Number of columns - ',len(pp_data.columns))

Number of columns -  3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [5]:
pl = {'col1':[1,2,3,4,7,11],'col2':[4,5,6,9,5,0],'col3':[7,5,8,12,1,11]}
pl_data = pd.DataFrame(pl)
print(pl_data)
pl_data.drop(pl_data.index[:-3])

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [9]:
#importing directly from google drive
data = pd.read_csv('https://docs.google.com/spreadsheets/d/10x4Qjw-CptYYv-vB-AGDIVcdHtCtnBZm/export?format=csv&gid=398633316')
data.head(20)

    Year  MSHA ID                       Mine_Name Production Labor_Hours
0   2013   103381            Tacoa Highwall Miner     56,004      22,392
1   2013   103404                Reid School Mine     28,807      28,447
2   2013   100759  North River #1 Underground Min  1,440,115     474,784
3   2013   103246                      Bear Creek     87,587      29,193
4   2013   103451                     Knight Mine    147,499      46,393
5   2013   103433              Crane Central Mine     69,339      47,195
6   2013   100329                    Concord Mine          0     144,002
7   2013   100851                  Oak Grove Mine  2,269,014   1,001,809
8   2013   102901                Shoal Creek Mine          0      12,396
9   2013   102901                Shoal Creek Mine  1,453,024   1,237,415
10  2013   103180             Sloan Mountain Mine    327,780     196,963
11  2013   103182                        Fishtrap    175,058      87,314
12  2013   103285                     Narley Mine    154,861      90,584
13  2013   103332                   Powhatan Mine    140,521      61,394
14  2013   103375                    Johnson Mine        580       1,900
15  2013   103419               Maxine-Pratt Mine    125,824     107,469
16  2013   103432                   Skelton Creek      8,252         220
17  2013   103437         Black Warrior Mine No 1    145,924      70,926
18  2013   102976   Piney Woods Preparation Plant          0      14,828
19  2013   102976   Piney Woods Preparation Plant          0      23,193

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [11]:
fil_ter=[]
for i in data['Mine_Name']:
    if(i[0]=='P'):
        fil_ter.append(True)
        
    else:
        fil_ter.append(False)
fil_ter
data[(pd.Series(fil_ter))]#, inplace = False)

    Year  MSHA ID                      Mine_Name Production Labor_Hours
13  2013   103332                  Powhatan Mine    140,521      61,394
18  2013   102976  Piney Woods Preparation Plant          0      14,828
19  2013   102976  Piney Woods Preparation Plant          0      23,193
46  2013   103321                 Poplar Springs    189,370      76,366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [7]:
data_employees = pd.read_csv('https://docs.google.com/spreadsheets/d/1V7GZGBiSM4FV5vGiKb31zLZdeySdPvf8/export?format=csv&gid=696462289')
data_employees['hire_date'] = pd.to_datetime(data_employees['hire_date'])
print(data_employees)
data1 = data_employees
data1[data1['hire_date']>'01-01-07']

#data1.where(fil, inplace= True)
#data1

    emp_id   first_name   last_name  hire_date
0      100       Steven        King 2003-06-17
1      101        Neena     Kochhar 2005-09-21
2      102          Lex     De Haan 2001-01-13
3      103    Alexander      Hunold 2006-03-01
4      104        Bruce       Ernst 2007-05-21
5      105        David      Austin 2005-06-25
6      106        Valli   Pataballa 2006-05-02
7      107        Diana     Lorentz 2007-07-02
8      108        Nancy   Greenberg 2002-08-17
9      109       Daniel      Faviet 2002-08-16
10     110         John        Chen 2005-09-28
11     111       Ismael     Sciarra 2005-09-30
12     112  Jose Manuel       Urman 2006-07-03
13     113         Luis        Popp 2007-07-12
14     114          Den    Raphaely 2002-07-12
15     115    Alexander        Khoo 2003-05-18
16     116       Shelli       Baida 2005-12-24
17     117        Sigal      Tobias 2005-07-24
18     118          Guy      Himuro 2006-11-15
19     119        Karen  Colmenares 2007-10-08

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-07-02
13     113       Luis        Popp 2007-07-12
19     119      Karen  Colmenares 2007-10-08

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [24]:
data_emp = pd.read_csv('https://docs.google.com/spreadsheets/d/1V7GZGBiSM4FV5vGiKb31zLZdeySdPvf8/export?format=csv&gid=696462289')
data_emp['hire_date'] = pd.to_datetime(data_emp['hire_date'])
data_emp
from datetime import datetime
year = input('Enter the year \n ')
years= datetime.strptime(year,'%Y')
type(years)
data_emp[data_emp['hire_date']>=years]

Enter the year
 2003

    emp_id   first_name   last_name  hire_date
0      100       Steven        King 2003-06-17
1      101        Neena     Kochhar 2005-09-21
3      103    Alexander      Hunold 2006-03-01
4      104        Bruce       Ernst 2007-05-21
5      105        David      Austin 2005-06-25
6      106        Valli   Pataballa 2006-05-02
7      107        Diana     Lorentz 2007-07-02
10     110         John        Chen 2005-09-28
11     111       Ismael     Sciarra 2005-09-30
12     112  Jose Manuel       Urman 2006-07-03
13     113         Luis        Popp 2007-07-12
15     115    Alexander        Khoo 2003-05-18
16     116       Shelli       Baida 2005-12-24
17     117        Sigal      Tobias 2005-07-24
18     118          Guy      Himuro 2006-11-15
19     119        Karen  Colmenares 2007-10-08

## Great Job!